## Pandas Operations

In [ ]:
import numpy as np
import pandas as pd

In [4]:
df_one = pd.DataFrame({'k1':['A', 'A', 'B', 'B', 'C', 'C'],
                      'col1':[100, 200, 300, 300, 400, 500],
                      'col2':['NY', 'CA', 'WA', 'WA', 'AK', 'NY']})
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NY

### Information on Unique Values

In [6]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK'], dtype=object)

In [7]:
#lenth/count of unique values
df_one['col2'].nunique()

4

In [9]:
#Count the repeated unique value
df_one['col2'].value_counts()

NY    2
WA    2
CA    1
AK    1
Name: col2, dtype: int64

In [14]:
#drop_duplicates mean drop the row/col if everythings is same
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NY

### Creating new column with operations and functions

In [16]:
df_one['NEW'] = df_one['col1']*10
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NY  5000

In [17]:
#Craete a function to grab first letter
def grab_first_letter(state):
    return state[0]

In [18]:
grab_first_letter('NY')

'N'

In [21]:
df_one['First Letter'] = df_one['col2'].apply(grab_first_letter)
df_one

  k1  col1 col2   NEW First Letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NY  5000            N

In [22]:
def complex_letter(state):
    if state[0] == 'W':
        return 'Washington'
    else:
        return 'Error'

In [23]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

### Mapping

In [24]:
my_map = {'A':1,
         'B':2,
         'C':3}

In [26]:
df_one['number'] = df_one['k1'].map(my_map)
df_one

  k1  col1 col2   NEW First Letter  number
0  A   100   NY  1000            N       1
1  A   200   CA  2000            C       1
2  B   300   WA  3000            W       2
3  B   300   WA  3000            W       2
4  C   400   AK  4000            A       3
5  C   500   NY  5000            N       3

### Locating Index positions of max and min values

In [27]:
df_one['col1'].max()

500

In [29]:
#location of max value
df_one['col1'].idxmax()

5

In [30]:
#location of min value
df_one['col1'].idxmin()

0

In [31]:
df_one

  k1  col1 col2   NEW First Letter  number
0  A   100   NY  1000            N       1
1  A   200   CA  2000            C       1
2  B   300   WA  3000            W       2
3  B   300   WA  3000            W       2
4  C   400   AK  4000            A       3
5  C   500   NY  5000            N       3

In [46]:
df_one.columns = ['C1','C2','C3','C4','C5','C6']
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NY  5000  N   3

### Sorting and Ordering a DataFrame:

In [35]:
df_one.sort_values('col1')

  k1  col1 col2   NEW First Letter  number
0  A   100   NY  1000            N       1
1  A   200   CA  2000            C       1
2  B   300   WA  3000            W       2
3  B   300   WA  3000            W       2
4  C   400   AK  4000            A       3
5  C   500   NY  5000            N       3

In [36]:
df_one.sort_values('col1', ascending=False)

  k1  col1 col2   NEW First Letter  number
5  C   500   NY  5000            N       3
4  C   400   AK  4000            A       3
2  B   300   WA  3000            W       2
3  B   300   WA  3000            W       2
1  A   200   CA  2000            C       1
0  A   100   NY  1000            N       1

### Concatenating DataFrames

In [37]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [38]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [39]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [43]:
pd.concat([features, predictions])

       A     B  pred
0  100.0  12.0   NaN
1  200.0  13.0   NaN
2  300.0  14.0   NaN
3  400.0  15.0   NaN
4  500.0  16.0   NaN
0    NaN   NaN   0.0
1    NaN   NaN   1.0
2    NaN   NaN   1.0
3    NaN   NaN   0.0
4    NaN   NaN   1.0

In [44]:
pd.concat([features, predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

### Creating Dummy Variables

In [47]:
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NY  5000  N   3

In [49]:
df_one['C1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [50]:
pd.get_dummies(df_one['C1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1